Autodesk.Revit.DB.Plumbing.PipeSettings.SetPressLossCalculationServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
Set the MEPServerInfo of the current pipe pressure loss calculation server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipeSettings.GetPressLossCalculationServerInfo
Get the MEPServerInfo of the current pipe pressure loss calculation server.
Returns:
The MEPServerInfo of the current pipe pressure loss calculation server
Since:
2012